
<script>
    import { executeClient } from 'api/rage'
    import { translateText } from 'lang'
    import { format } from 'api/formatter'
    import './css/main.sass';
    import './css/main.css';
    import './fonts/style.css';
    import './fonts/Gilroy/stylesheet.css';
    import './fonts/SFPro/stylesheet.css';
    import authInfo from './authInfo';
    const authColors =[
        "#000",
        "#fff",
        "#e60000",
        "#ff7300",
        "#f0f000",
        "#00e600",
        "#00cdff",
        "#0000e6",
        "#be3ca5",
    ];
    let list = [];
    let select = 0;
    let selectTime = -1;
    let sordId = "speed";
    let colorId = 0;

    let isDonateAutoroom = false;

    window.authShop = {
        data: (value, isDonate = false) => {
            let returnList = [];
            let modelInfo;
            JSON.parse(value).forEach(value => {
                modelInfo = authInfo [value.modelName] || false;
                
                returnList = [
                    ...returnList, {
                        ...value,
                        speed: (!modelInfo || (modelInfo && !modelInfo.maxSpeed)) ? value.speed : modelInfo.maxSpeed,
                        boost: (!modelInfo || (modelInfo && !modelInfo.acceleration)) ? value.boost : modelInfo.acceleration,
                        seat: (!modelInfo || (modelInfo && !modelInfo.seats)) ? value.seat : modelInfo.seats,
                        name: (!modelInfo || (modelInfo && !modelInfo.name)) ? value.name : modelInfo.name,
                        model: (!modelInfo || (modelInfo && !modelInfo.model)) ? value.model : modelInfo.model,
                        img: (!modelInfo || (modelInfo && !modelInfo.img)) ? value.img : modelInfo.img,
                        invslots: (value.invslots !== undefined) ? value.invslots : 25,
                        desc: !modelInfo ? false : modelInfo.desc,
                    }
                ];
            });
            list = returnList;
            isDonateAutoroom = isDonate;
            return;
        }
    }


    const sort = (value) => {
        if (sordId === value) return;
        let sortList = list;
        let sortSelect = -1;
        if (select !== -1 && list[select]) sortSelect = list[select].index;
        sordId = value;
        sortList.sort(( b, a ) =>  b[value] - a[value]);
        if (sortSelect !== -1) {
            sortList.forEach((value, index) => {
                if (sortSelect === value.index) {
                    select = index;
                }
            });
        }
        list = sortList;
    }

    let container;

    function handleWheel(event) {
        event.preventDefault();

        container.scrollBy({
        left: event.deltaY < 0 ? -30 : 30,
        });
    }

    const setItem = (index) => {
        if (!list[index]) return;
        else if (index === select) return;
        //else if (selectTime > new Date().getTime()) return;
        //selectTime = new Date().getTime() + 1000;
        select = index;
        executeClient ('auto', 'model', list[index].index);
    }

    const setColor = (index) => {
        if (index === colorId) return;
        colorId = index;
        executeClient ('auto', 'color', index);
    }

    const startTestDrive = (type) => {
        if (select === -1 || !list[select]) return;
        executeClient ('testDrive', type);
    }

    const HandleKeyDown = (event) => {
        const { keyCode } = event;
        if (keyCode !== 27) return;

        executeClient ('closeAuto');
    }
</script>

<svelte:window on:keyup={HandleKeyDown} />

<div class="autogta5dev">
    <div class="autoclosed">
        <p>Выйти из автосалона</p>
        <b on:keypress={() => {}} on:click={() => executeClient ('closeAuto')}>X</b>
    </div>
    {#if (select !== -1 && list [select])}
    <div class="autoleft">
        <span>{isDonateAutoroom === true ? 'RB' : '$'}{format("money", list [select].price)}</span>
        <h1>{list [select].modelName}</h1>
        <div class="btntest">
            <div on:keypress={() => {}} on:click={() => executeClient ('buyAuto', 1, 'closeAuto')} class="test">Купить</div>
            <div on:keypress={() => {}} on:click={() => executeClient ('buyAuto', 2, 'closeAuto')} class="test">Купить на организацию</div>
            <div on:keypress={() => {}} on:click={() => startTestDrive (1)} class="test1">Тест-драйв</div>
            <div on:keypress={() => {}} on:click={() => startTestDrive (2)} class="test1">Тест-драйв FT</div>
        </div>
    </div>
    {/if}
    <div class="autobottom">
        <div class="abhead">
            <h1>Список автомобилей</h1>
            <div class="line"></div>
        </div>
        <div class="carslist" on:mouseenter={() => executeClient ("client.camera.toggled", false)} on:mouseleave={() => executeClient ("client.camera.toggled", true)} on:wheel="{handleWheel}" bind:this="{container}">
            {#each list as value, index}
                <div class="blockcar"  class:active={select === index} on:keypress={() => {}} on:click={() => setItem (index)}>
                    <img src="http://cdn.piecerp.ru/cloud/inventoryItems/vehicle/{value.modelName}.png" alt=""/>
                    <div class="bcarinfo">
                        <div class="namecar">
                            <b>{@html value.modelName}</b>
                        </div>
                        <div class="pricecar">
                            <span>{isDonateAutoroom === true ? 'RB' : '$'}{format("money", value.price)}</span>
                        </div>
                    </div>
                </div>
            {/each}
        </div>
    </div>
    {#if (select !== -1 && list [select])}
    <div class="autoright">
        <div class="autohar">
            <div class="iconhar">
                <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g opacity="0.25">
                    <path d="M0.817879 10.6678H0.824279C0.890975 10.667 0.954918 10.6411 1.00349 10.5954C1.05207 10.5497 1.08175 10.4874 1.08668 10.4209C1.15551 9.66052 1.37948 8.92231 1.74475 8.25186C2.11002 7.5814 2.60884 6.99293 3.21041 6.52278L2.52428 5.83691C1.36425 7.08221 0.666812 8.68794 0.548546 10.3857C0.546421 10.4222 0.551835 10.4588 0.564451 10.4932C0.577066 10.5275 0.596613 10.5589 0.621876 10.5853C0.647139 10.6118 0.677577 10.6328 0.711296 10.647C0.745016 10.6612 0.781296 10.6683 0.817879 10.6678Z" fill="white"/>
                    <path d="M6.53336 11.466C6.75428 11.466 6.93336 11.2869 6.93336 11.066C6.93336 10.8451 6.75428 10.666 6.53336 10.666C6.31245 10.666 6.13336 10.8451 6.13336 11.066C6.13336 11.2869 6.31245 11.466 6.53336 11.466Z" fill="white"/>
                    <path d="M7.73336 5.43479V3.47266C5.9357 3.53025 4.21962 4.2365 2.90216 5.46092L3.65336 6.21106C4.55323 5.63635 5.59896 5.33161 6.66669 5.33292C7.02467 5.33317 7.38181 5.36728 7.73336 5.43479ZM8.26669 3.47266V5.56466C8.46366 5.62346 8.6572 5.69317 8.84643 5.77346C8.99789 5.62466 9.14803 5.47772 9.29416 5.33532C9.40322 5.22753 9.54568 5.16001 9.69816 5.14383C9.85065 5.12764 10.0041 5.16376 10.1334 5.24626C10.2627 5.32335 10.362 5.44212 10.415 5.58307C10.4679 5.72403 10.4714 5.8788 10.4248 6.02199C10.367 6.20519 10.303 6.40519 10.2366 6.61212C10.5484 6.8693 10.8315 7.15953 11.0808 7.47772L13.099 5.46092C11.7813 4.23614 10.0648 3.52985 8.26669 3.47266ZM13.4758 5.83719L11.3923 7.91959C11.8716 8.67152 12.1641 9.52711 12.2456 10.4151C12.2505 10.482 12.2805 10.5446 12.3295 10.5904C12.3785 10.6363 12.4431 10.6619 12.5102 10.6623L15.1811 10.6663C15.2175 10.6663 15.2534 10.6589 15.2868 10.6446C15.3203 10.6302 15.3504 10.6092 15.3753 10.5828C15.4003 10.5563 15.4196 10.5251 15.4321 10.4909C15.4445 10.4568 15.4499 10.4204 15.4478 10.3841C15.3312 8.68721 14.635 7.0819 13.4758 5.83719Z" fill="white"/>
                    <path d="M9.85199 5.69952C9.82608 5.68309 9.79625 5.67389 9.76559 5.67285C9.74705 5.67295 9.72873 5.6768 9.71172 5.68418C9.69472 5.69156 9.67939 5.70231 9.66666 5.71579C7.25706 8.06245 5.69519 9.73685 5.26826 10.4323C5.17415 10.5829 5.11119 10.7508 5.08311 10.9262C5.05504 11.1015 5.06241 11.2807 5.10479 11.4531C5.14878 11.6339 5.22854 11.8041 5.33938 11.9536C5.45022 12.1031 5.58988 12.2289 5.75012 12.3235C6.06646 12.5177 6.44645 12.5799 6.80819 12.4966C7.16993 12.4133 7.48446 12.1912 7.68399 11.8782C8.26666 10.9395 9.33146 7.70592 9.91546 5.86032C9.9257 5.83035 9.92494 5.7977 9.91331 5.76824C9.90168 5.73878 9.87995 5.71441 9.85199 5.69952ZM6.53332 11.9993C6.34873 11.9993 6.16828 11.9445 6.01479 11.842C5.8613 11.7394 5.74168 11.5936 5.67104 11.4231C5.60039 11.2525 5.58191 11.0649 5.61792 10.8838C5.65394 10.7028 5.74283 10.5365 5.87336 10.406C6.00389 10.2754 6.17019 10.1865 6.35124 10.1505C6.53229 10.1145 6.71995 10.133 6.89049 10.2036C7.06104 10.2743 7.20681 10.3939 7.30936 10.5474C7.41192 10.7009 7.46666 10.8813 7.46666 11.0659C7.46666 11.3135 7.36832 11.5509 7.19329 11.7259C7.01826 11.9009 6.78086 11.9993 6.53332 11.9993Z" fill="white"/>
                    </g>
                </svg>                            
            </div>
            <div class="infohar">
                <div class="namehar">
                    <p>Скорость</p>
                    <p>{list [select].speed}км/ч</p>
                </div>
                <div class="barhar">
                    <div class="barik {list [select].speed >0 ? `active` : ``}"></div>
                    <div class="barik {list [select].speed >48 ? `active` : ``}"></div>
                    <div class="barik {list [select].speed >96 ? `active` : ``}"></div>
                    <div class="barik {list [select].speed >192 ? `active` : ``}"></div>
                    <div class="barik {list [select].speed >240 ? `active` : ``}"></div>
                </div>
            </div>
        </div>
        <div class="autohar">
            <div class="iconhar">
                <svg width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g opacity="0.25">
                    <path d="M4.28523 7.24999C4.28523 6.92699 4.54755 6.66462 4.87059 6.66462H7.93842C7.65502 4.73643 5.99255 3.25198 3.99071 3.25198C1.7904 3.25198 0 5.04558 0 7.25003C0 9.45491 1.7904 11.2485 3.99071 11.2485C5.99298 11.2485 7.65502 9.76359 7.93842 7.83539H4.87059C4.54755 7.83539 4.28523 7.57342 4.28523 7.24999ZM19.6936 6.60929L17.7221 4.8489C17.4809 4.63387 17.1109 4.65456 16.8956 4.89573C16.6806 5.1369 16.7012 5.50716 16.9424 5.72226L17.998 6.66462H7.93842C7.96675 6.85545 7.98127 7.05108 7.98127 7.24999C7.98127 7.44862 7.96675 7.64425 7.93842 7.83539L17.998 7.83536L16.9424 8.77791C16.7012 8.99333 16.6806 9.36328 16.8956 9.60445C16.9505 9.66603 17.0178 9.71529 17.0932 9.74897C17.1685 9.78265 17.2501 9.79998 17.3326 9.79984C17.4712 9.79984 17.6105 9.75106 17.7221 9.6512L19.6936 7.89116C19.7829 7.81134 19.8545 7.71378 19.9039 7.60472C19.9533 7.49565 19.9794 7.37748 19.9805 7.25776V7.24219C19.9793 7.12253 19.9532 7.00445 19.9038 6.89546C19.8544 6.78648 19.7828 6.689 19.6936 6.60925V6.60929ZM11.7317 2.53627C11.7317 2.85959 11.9938 3.12164 12.3171 3.12164H18.6976C19.0207 3.12164 19.2829 2.85959 19.2829 2.53627C19.2829 2.21296 19.0207 1.95091 18.6976 1.95091H12.3171C11.9938 1.95091 11.7317 2.21296 11.7317 2.53627ZM8.09237 1.17073H13.0295C13.3528 1.17073 13.6148 0.908683 13.6148 0.585366C13.6148 0.262049 13.3528 0 13.0295 0H8.09237C7.76905 0 7.50701 0.262049 7.50701 0.585366C7.50701 0.908683 7.76905 1.17073 8.09237 1.17073ZM14.97 1.17073H15.8831C16.2062 1.17073 16.4684 0.908683 16.4684 0.585366C16.4684 0.262049 16.2062 0 15.8831 0H14.97C14.6466 0 14.3846 0.262049 14.3846 0.585366C14.3846 0.908683 14.6466 1.17073 14.97 1.17073ZM8.36371 3.0823C8.04039 3.0823 7.77834 3.34455 7.77834 3.66767C7.77834 3.99102 8.04039 4.25303 8.36371 4.25303H9.27684C9.60016 4.25303 9.8622 3.99102 9.8622 3.66767C9.8622 3.34455 9.60016 3.0823 9.27684 3.0823H8.36371ZM10.0587 10.1058C10.3819 10.1058 10.6441 9.84375 10.6441 9.52039C10.6441 9.19711 10.3819 8.93502 10.0587 8.93502H9.14544C8.82224 8.93502 8.56008 9.19711 8.56008 9.52039C8.56008 9.84375 8.82224 10.1058 9.14544 10.1058H10.0587ZM6.96176 13.6977H3.70322C3.37986 13.6977 3.11785 13.9599 3.11785 14.2831C3.11785 14.6064 3.37986 14.8684 3.70322 14.8684H6.96176C7.28507 14.8684 7.54712 14.6064 7.54712 14.2831C7.54712 13.9599 7.28507 13.6977 6.96176 13.6977ZM9.81541 13.6977H8.90213C8.57897 13.6977 8.31676 13.9599 8.31676 14.2831C8.31676 14.6064 8.57897 14.8684 8.90213 14.8684H9.81541C10.1385 14.8684 10.4008 14.6064 10.4008 14.2831C10.4008 13.9599 10.1387 13.6977 9.81541 13.6977ZM14.3084 11.7468H6.63965C6.31629 11.7468 6.05428 12.009 6.05428 12.3322C6.05428 12.6555 6.31629 12.9175 6.63965 12.9175H14.3084C14.6317 12.9175 14.8937 12.6555 14.8937 12.3322C14.8937 12.009 14.6317 11.7468 14.3084 11.7468ZM14.0371 14.8293H13.1239C12.8008 14.8293 12.5385 15.0913 12.5385 15.4146C12.5385 15.738 12.8008 16 13.1239 16H14.0371C14.3604 16 14.6224 15.738 14.6224 15.4146C14.6224 15.0913 14.3604 14.8293 14.0371 14.8293Z" fill="white"/>
                    </g>
                </svg>                                                      
            </div>
            <div class="infohar">
                <div class="namehar">
                    <p>Ускорение</p>
                    <p>{list [select].boost}</p>
                </div>
                <div class="barhar">
                    <div class="barik {list [select].boost >0 ? `active` : ``}"></div>
                    <div class="barik {list [select].boost >3.4 ? `active` : ``}"></div>
                    <div class="barik {list [select].boost >6.8 ? `active` : ``}"></div>
                    <div class="barik {list [select].boost >10.2 ? `active` : ``}"></div>
                    <div class="barik {list [select].boost >13.6 ? `active` : ``}"></div>
                </div>
            </div>
        </div>
        <div class="autohar">
            <div class="iconhar">
                <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g opacity="0.25" clip-path="url(#clip0_353_116)">
                    <path d="M8.00002 0C6.77773 0 5.78333 0.994406 5.78333 2.21669C5.78333 2.32797 5.7918 2.43725 5.8077 2.54419H6.77089C6.74238 2.43736 6.72794 2.32726 6.72795 2.21669C6.72795 1.51525 7.29861 0.944594 8.00005 0.944594C8.70148 0.944594 9.27211 1.51525 9.27211 2.21669C9.2721 2.32726 9.25767 2.43735 9.22917 2.54419H10.1924C10.2083 2.43728 10.2167 2.32797 10.2167 2.21669C10.2166 0.994406 9.22227 0 8.00002 0ZM15.5327 12.5941L14.3474 5.88522C14.1021 4.49659 12.9006 3.48875 11.4905 3.48875H4.50952C3.09945 3.48875 1.89792 4.49659 1.65258 5.88522L0.467328 12.5941C0.317734 13.4409 0.548922 14.3044 1.10155 14.9633C1.6542 15.6222 2.46433 16 3.3243 16H12.6758C13.5358 16 14.3459 15.6221 14.8985 14.9633C15.4512 14.3045 15.6823 13.4409 15.5327 12.5941ZM7.61955 11.6352C7.53154 11.7206 7.41373 11.7682 7.29114 11.7681C7.22779 11.7682 7.16507 11.7555 7.10674 11.7308C7.04841 11.7061 6.99567 11.6698 6.95167 11.6243L5.62811 10.2565V11.2958C5.62811 11.5567 5.41664 11.7681 5.1558 11.7681C4.89495 11.7681 4.68348 11.5567 4.68348 11.2958V8.19294C4.68348 7.93209 4.89495 7.72062 5.1558 7.72062C5.41664 7.72062 5.62811 7.93209 5.62811 8.19294V9.23222L6.95167 7.8645C7.13308 7.67706 7.43205 7.67216 7.61955 7.85353C7.80698 8.03494 7.81186 8.33391 7.63052 8.52137L6.44702 9.74438L7.63052 10.9674C7.81189 11.1548 7.80698 11.4538 7.61955 11.6352ZM9.80455 11.7681C8.97077 11.7681 8.29242 11.0898 8.29242 10.256V9.23281C8.29242 8.39903 8.97077 7.72069 9.80455 7.72069C10.2735 7.72069 10.7081 7.93287 10.997 8.30287C11.1575 8.50847 11.121 8.80531 10.9153 8.96578C10.7097 9.12631 10.4129 9.08972 10.2524 8.88412C10.1438 8.74506 9.98058 8.66525 9.80451 8.66525C9.49158 8.66525 9.23698 8.91984 9.23698 9.23278V10.2559C9.23698 10.5689 9.49158 10.8235 9.80451 10.8235C10.0854 10.8235 10.3193 10.6184 10.3642 10.3501H10.1354C9.87452 10.3501 9.66305 10.1386 9.66305 9.87775C9.66305 9.61691 9.87452 9.40544 10.1354 9.40544H10.8443C11.1052 9.40544 11.3166 9.61691 11.3166 9.87775V10.2559H11.3167C11.3167 11.0898 10.6383 11.7681 9.80455 11.7681Z" fill="white"/>
                    </g>
                    <defs>
                    <clipPath id="clip0_353_116">
                    <rect width="16" height="16" fill="white"/>
                    </clipPath>
                    </defs>
                </svg>                                                       
            </div>
            <div class="infohar">
                <div class="namehar">
                    <p>Багажник</p>
                    <p>{list [select].invslots}кг</p>
                </div>
                <div class="barhar">
                    <div class="barik {list [select].invslots >0 ? `active` : ``}"></div>
                    <div class="barik {list [select].invslots >30 ? `active` : ``}"></div>
                    <div class="barik {list [select].invslots >60 ? `active` : ``}"></div>
                    <div class="barik {list [select].invslots >90 ? `active` : ``}"></div>
                    <div class="barik {list [select].invslots >150 ? `active` : ``}"></div>
                </div>
            </div>
        </div>
        <div class="autohar">
            <div class="iconhar">
                <svg width="16" height="16" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g opacity="0.25">
                    <path d="M13.5849 11.9029C13.3962 11.5808 13.0951 11.3398 12.7395 11.2262L12.6962 11.2132C12.6442 11.1966 12.5906 11.1857 12.5362 11.1807C12.2586 11.2494 11.9973 11.3725 11.7676 11.5429C11.5379 11.7132 11.3442 11.9275 11.1979 12.1732L10.9903 15.1353C10.9579 15.1353 10.973 15.1353 10.9903 15.1353L10.973 15.5678H11.1373C13.2714 15.5678 13.6714 13.7602 13.706 13.5764C13.8833 12.904 13.8379 12.3397 13.5849 11.9029ZM5.00975 15.1353L4.79354 12.1797C4.60975 12.011 4.2011 11.2283 3.45516 11.1851C3.40103 11.1915 3.34752 11.2023 3.29516 11.2175H3.26489C2.90133 11.3279 2.5926 11.571 2.40002 11.8986C2.14272 12.331 2.10164 12.8997 2.27894 13.5721C2.31354 13.7537 2.71137 15.5635 4.84759 15.5635H5.01191L4.99462 15.131C5.02705 15.1353 5.04002 15.1353 5.00975 15.1353ZM6.34381 3.64129H6.77624V4.34615H6.0411V7.55048H9.9611V4.34615H9.22597V3.64129H9.6584C9.76804 3.64132 9.87645 3.61826 9.97658 3.5736C10.0767 3.52894 10.1663 3.46369 10.2395 3.3821C10.3128 3.30051 10.368 3.2044 10.4016 3.10004C10.4352 2.99569 10.4465 2.88542 10.4346 2.77642L10.2487 1.13534C10.2298 0.941912 10.1392 0.762546 9.99477 0.632511C9.85033 0.502476 9.66247 0.431179 9.46813 0.432639H6.53191C6.33828 0.431669 6.15123 0.502907 6.00731 0.632444C5.86338 0.76198 5.7729 0.940513 5.75354 1.13318L5.56759 2.77859C5.55574 2.88758 5.56699 2.99785 5.60061 3.1022C5.63422 3.20656 5.68944 3.30267 5.76267 3.38426C5.8359 3.46585 5.9255 3.53111 6.02563 3.57576C6.12576 3.62042 6.23417 3.64348 6.34381 3.64345V3.64129ZM8.79353 4.34615H7.20651V3.64129H8.79353V4.34615Z" fill="white"/>
                    <path d="M12.4432 10.7591L12.5081 10.744H12.6184C12.4454 9.6845 12.2205 7.96342 12.3222 6.59909C12.37 6.32501 12.3619 6.04408 12.2984 5.7732C12.2349 5.50232 12.1172 5.24709 11.9524 5.02288C11.6173 4.6099 11.0876 4.37423 10.3935 4.3418V11.864H5.60648V4.35477C4.9081 4.39369 4.3827 4.62288 4.04756 5.03585C3.88244 5.2599 3.76437 5.51505 3.70046 5.78593C3.63654 6.05682 3.62811 6.33784 3.67567 6.61207C3.77729 7.97639 3.55243 9.69747 3.37946 10.7569C3.38952 10.7579 3.39966 10.7579 3.40973 10.7569H3.48756C4.2681 10.8023 4.73946 11.4056 5.00108 11.7386C5.03261 11.7836 5.06653 11.8269 5.1027 11.8683L5.21729 11.9807L5.24108 12.1537V12.305L5.47027 15.5483H5.45729V15.5677H10.5384L10.573 14.7029H10.5946L10.7827 12.0391L10.8389 11.9483C11.0134 11.653 11.2452 11.3956 11.5208 11.1914C11.7963 10.9872 12.11 10.8402 12.4432 10.7591Z" fill="white"/>
                    <path d="M6.03894 7.98242H9.9611V11.4311H6.03894V7.98242Z" fill="white"/>
                    </g>
                </svg>                                                      
            </div>
            <div class="infohar">
                <div class="namehar">
                    <p>Вместимость</p>
                    <p>{list [select].seat}чел.</p>
                </div>
                <div class="barhar">
                    <div class="barik {list [select].seat >0 ? `active` : ``}"></div>
                    <div class="barik {list [select].seat >3.2 ? `active` : ``}"></div>
                    <div class="barik {list [select].seat >6.4 ? `active` : ``}"></div>
                    <div class="barik {list [select].seat >9.6 ? `active` : ``}"></div>
                    <div class="barik {list [select].seat >12.8 ? `active` : ``}"></div>
                </div>
            </div>
        </div>
        <h1>Цвет автомобиля</h1>
        <div class="clolorlist">
            {#each authColors as value, index}
                <div key={index} class={`color ${colorId !== index || "active"}`} on:keypress={() => {}} on:click={() => setColor (index)} style="background: {value}" ></div>
            {/each}
        </div>
    </div>
    {/if}
</div>