export default {
  Электрик:  'Изучение трав и создание зелий.',
  Почтальон:  'Доставка заказанных по почте товаров с помощью фургона и ручного труда.',
  Таксист:  '',
  'Водитель автобуса': 'Безопасное перемещение пассажиров по городу, следуя маршруту и расписанию, а также останавливаясь на обозначенных остановках.',
  Газонокосильщик: '',
  Дальнобойщик: 'Выполнение заказов на доставку разного вида товаров от компаний и частных лиц.',
  Инкассатор: 'Сбор и пополнение наличных средств в банкоматах по всему штату.',
  Автомеханик: '',
};
